RIOT-OS/RIOT/cpu/stm32f1/periph/gpio.c
    if (pin < 8) {
        if (port->CRL & (0x3 << (pin * 4))) {  /* if configured as output */
            return port->ODR & (1 << pin);          /* read output data register */
        } else {
            return port->IDR & (1 << pin);          /* else read input data register */
        }
    }
    else {
        if (port->CRH & (0x3 << ((pin-8) * 4))) {  /* if configured as output */
            return port->ODR & (1 << pin);          /* read output data register */
        } else {
            return port->IDR & (1 << pin);          /* else read input data register */
        }
    }
}

void gpio_set(gpio_t dev)
{
    switch (dev) {
#ifdef GPIO_0_EN
        case GPIO_0:
            GPIO_0_PORT->BSRR = (1 << GPIO_0_PIN);
            break;
#endif
#ifdef GPIO_1_EN
        case GPIO_1:
            GPIO_1_PORT->BSRR = (1 << GPIO_1_PIN);
            break;
#endif
#ifdef GPIO_2_EN
        case GPIO_2:
            GPIO_2_PORT->BSRR = (1 << GPIO_2_PIN);
            break;
#endif
#ifdef GPIO_3_EN
        case GPIO_3:
            GPIO_3_PORT->BSRR = (1 << GPIO_3_PIN);
            break;
#endif
#ifdef GPIO_4_EN
        case GPIO_4:
            GPIO_4_PORT->BSRR = (1 << GPIO_4_PIN);
            break;
#endif
#ifdef GPIO_5_EN
        case GPIO_5:
            GPIO_5_PORT->BSRR = (1 << GPIO_5_PIN);
            break;
#endif
#ifdef GPIO_6_EN
        case GPIO_6:
            GPIO_6_PORT->BSRR = (1 << GPIO_6_PIN);
            break;
#endif
#ifdef GPIO_7_EN
        case GPIO_7:
            GPIO_7_PORT->BSRR = (1 << GPIO_7_PIN);
            break;
#endif
#ifdef GPIO_8_EN
        case GPIO_8:
            GPIO_8_PORT->BSRR = (1 << GPIO_8_PIN);
            break;
#endif
#ifdef GPIO_9_EN
        case GPIO_9:
            GPIO_9_PORT->BSRR = (1 << GPIO_9_PIN);
            break;
#endif
#ifdef GPIO_10_EN
        case GPIO_10:
            GPIO_10_PORT->BSRR = (1 << GPIO_10_PIN);
            break;
#endif
#ifdef GPIO_11_EN
        case GPIO_11:
            GPIO_11_PORT->BSRR = (1 << GPIO_11_PIN);
            break;
#endif
#ifdef GPIO_12_EN
        case GPIO_12:
            GPIO_12_PORT->BSRR = (1 << GPIO_12_PIN);
            break;
#endif
#ifdef GPIO_13_EN
        case GPIO_13:
            GPIO_13_PORT->BSRR = (1 << GPIO_13_PIN);
            break;
#endif
#ifdef GPIO_14_EN
        case GPIO_14:
            GPIO_14_PORT->BSRR = (1 << GPIO_14_PIN);
            break;
#endif
#ifdef GPIO_15_EN
        case GPIO_15:
            GPIO_15_PORT->BSRR = (1 << GPIO_15_PIN);
            break;
#endif
    }
}

void gpio_clear(gpio_t dev)
{
    switch (dev) {
#ifdef GPIO_0_EN
        case GPIO_0:
            GPIO_0_PORT->BRR = (1 << GPIO_0_PIN);
            break;
#endif
#ifdef GPIO_1_EN
        case GPIO_1:
            GPIO_1_PORT->BRR = (1 << GPIO_1_PIN);
            break;
#endif
#ifdef GPIO_2_EN
        case GPIO_2:
            GPIO_2_PORT->BRR = (1 << GPIO_2_PIN);
            break;
#endif
#ifdef GPIO_3_EN
        case GPIO_3:
            GPIO_3_PORT->BRR = (1 << GPIO_3_PIN);
            break;
#endif
#ifdef GPIO_4_EN
        case GPIO_4:
            GPIO_4_PORT->BRR = (1 << GPIO_4_PIN);
            break;
#endif
#ifdef GPIO_5_EN
        case GPIO_5:
            GPIO_5_PORT->BRR = (1 << GPIO_5_PIN);
            break;
#endif
#ifdef GPIO_6_EN
        case GPIO_6:
            GPIO_6_PORT->BRR = (1 << GPIO_6_PIN);
            break;
#endif
#ifdef GPIO_7_EN
        case GPIO_7:
            GPIO_7_PORT->BRR = (1 << GPIO_7_PIN);
            break;
#endif
#ifdef GPIO_8_EN
        case GPIO_8:
            GPIO_8_PORT->BRR = (1 << GPIO_8_PIN);
            break;
#endif
#ifdef GPIO_9_EN
        case GPIO_9:
            GPIO_9_PORT->BRR = (1 << GPIO_9_PIN);
            break;
#endif
#ifdef GPIO_10_EN
        case GPIO_10:
            GPIO_10_PORT->BRR = (1 << GPIO_10_PIN);
            break;
#endif
#ifdef GPIO_11_EN
        case GPIO_11:
            GPIO_11_PORT->BRR = (1 << GPIO_11_PIN);
            break;
#endif
#ifdef GPIO_12_EN
        case GPIO_12:
            GPIO_12_PORT->BRR = (1 << GPIO_12_PIN);
            break;
#endif
#ifdef GPIO_13_EN
        case GPIO_13:
            GPIO_13_PORT->BRR = (1 << GPIO_13_PIN);
            break;
#endif
#ifdef GPIO_14_EN
        case GPIO_14:
            GPIO_14_PORT->BRR = (1 << GPIO_14_PIN);
            break;
#endif
#ifdef GPIO_15_EN
        case GPIO_15:
            GPIO_15_PORT->BRR = (1 << GPIO_15_PIN);
            break;
#endif
    }
}


void gpio_toggle(gpio_t dev)
{
    if (gpio_read(dev)) {
        gpio_clear(dev);
    }
    else {
        gpio_set(dev);
    }
}

void gpio_write(gpio_t dev, int value)
{
    if (value) {
        gpio_set(dev);
    }
    else {
        gpio_clear(dev);
    }
}

__attribute__((naked)) void isr_exti0(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR0) {
        EXTI->PR |= EXTI_PR_PR0;        /* clear status bit by writing a 1 to it */
        config[GPIO_0].cb(config[GPIO_0].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti1(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR1) {
        EXTI->PR |= EXTI_PR_PR1;        /* clear status bit by writing a 1 to it */
        config[GPIO_1].cb(config[GPIO_1].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti2(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR2) {
        EXTI->PR |= EXTI_PR_PR2;        /* clear status bit by writing a 1 to it */
        config[GPIO_2].cb(config[GPIO_2].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti3(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR3) {
        EXTI->PR |= EXTI_PR_PR3;        /* clear status bit by writing a 1 to it */
        config[GPIO_3].cb(config[GPIO_3].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti4(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR4) {
        EXTI->PR |= EXTI_PR_PR4;        /* clear status bit by writing a 1 to it */
        config[GPIO_4].cb(config[GPIO_4].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti9_5(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR5) {
        EXTI->PR |= EXTI_PR_PR5;        /* clear status bit by writing a 1 to it */
        config[GPIO_5].cb(config[GPIO_5].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR6) {
        EXTI->PR |= EXTI_PR_PR6;        /* clear status bit by writing a 1 to it */
        config[GPIO_6].cb(config[GPIO_6].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR7) {
        EXTI->PR |= EXTI_PR_PR7;        /* clear status bit by writing a 1 to it */
        config[GPIO_7].cb(config[GPIO_7].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR8) {
        EXTI->PR |= EXTI_PR_PR8;        /* clear status bit by writing a 1 to it */
        config[GPIO_8].cb(config[GPIO_8].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR9) {
        EXTI->PR |= EXTI_PR_PR9;        /* clear status bit by writing a 1 to it */
        config[GPIO_9].cb(config[GPIO_9].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}

__attribute__((naked)) void isr_exti15_10(void)
{
    ISR_ENTER();
    if (EXTI->PR & EXTI_PR_PR10) {
        EXTI->PR |= EXTI_PR_PR10;        /* clear status bit by writing a 1 to it */
        config[GPIO_10].cb(config[GPIO_10].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR11) {
        EXTI->PR |= EXTI_PR_PR11;        /* clear status bit by writing a 1 to it */
        config[GPIO_11].cb(config[GPIO_11].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR12) {
        EXTI->PR |= EXTI_PR_PR12;        /* clear status bit by writing a 1 to it */
        config[GPIO_12].cb(config[GPIO_12].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR13) {
        EXTI->PR |= EXTI_PR_PR13;        /* clear status bit by writing a 1 to it */
        config[GPIO_13].cb(config[GPIO_13].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR14) {
        EXTI->PR |= EXTI_PR_PR14;        /* clear status bit by writing a 1 to it */
        config[GPIO_14].cb(config[GPIO_14].arg);
    }
    else if (EXTI->PR & EXTI_PR_PR15) {
        EXTI->PR |= EXTI_PR_PR15;        /* clear status bit by writing a 1 to it */
        config[GPIO_15].cb(config[GPIO_15].arg);
    }

    if (sched_context_switch_request) {
        thread_yield();
    }
    ISR_EXIT();
}
